app/views/scenes/_thumbnail.html.erb

		<%if scene%>
		  <%last_index = scene.events.count%>
	      <%event = Event.for_scene(scene).at(last_index).first%>
---
SELECT "events".* FROM "events" WHERE (scene_id=20 ) AND (order_index <= 6) AND (type='BackgroundImageEvent') ORDER BY order_index DESC LIMIT 1
SELECT COUNT(*) FROM "events" WHERE "events"."scene_id" = 20
SELECT "scenes".* FROM "scenes" WHERE (project_id=8 ) AND (order_index = 1) LIMIT 1