app/views/scenes/edit.html.erb

<%
  current_event = Event.for_scene(@scene).at(@event_index).first
---
SELECT "events".* FROM "events" WHERE (scene_id=10 ) AND (order_index <= 10) AND (type='CharacterPoseEvent' and character_id=2) ORDER BY order_index DESC LIMIT 1

			  	 	<tbody>
			  	 	<%if Event.for_scene(@scene).empty?%>
---
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "events" WHERE (scene_id=10 ) AND (order_index <= 1) AND (type='CharacterPoseEvent' and character_id=2) LIMIT 1) subquery_for_count

			  	 <h3>Add to the Script!</h3>
			  	<%character = @project.characters.where(:type=>"Narrator").first%>
---
SELECT "characters".* FROM "characters" WHERE "characters"."project_id" = 8 AND "characters"."type" = 'Narrator' LIMIT 1

		      <%if @scene.love_scene?
		      	sexes = @project.characters.pluck(:sex)
---
SELECT "characters"."sex" FROM "characters" WHERE "characters"."project_id" = 8