app/views/scenes/edit.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = 21 LIMIT 1
---
		  	        	<%if num = current_event.characters_present.try(:second).try(:first)%>
		  	        	  <%=render :partial=>"character_action_items", :locals=>{:character=>Character.find(num)}%>