app/views/projects/play.html.erb

SELECT "events".* FROM "events" WHERE "events"."scene_id" = 20 ORDER BY order_index ASC, id ASC
SELECT "scenes".* FROM "scenes" WHERE "scenes"."project_id" = 8 ORDER BY order_index ASC, id ASC
---
        <script>
          var scenes = <%=json_escape(@project.scenes.ordered.map{|scene| scene.events.ordered}.flatten.to_json(:methods=>[:event_type, :get_character_name], :except=>[:created_at, :updated_at]).html_safe)%>;