app/views/projects/show.html.erb

          <%middle_index = @project.middle_index%>
          <%scene = Scene.for_project(@project).at(middle_index).first%>
---
SELECT "scenes".* FROM "scenes" WHERE (project_id=8 ) AND (order_index = 1) LIMIT 1