app/views/characters/index.html.erb


	<% Character.available_for(session_obj).each do |named_character| %>
---
SELECT "characters".* FROM "characters" WHERE "characters"."type" IN ('Narrator') AND (project_id=8) LIMIT 1