app/controllers/characters_controller.rb

  def index
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "8"]]

  def toggle
    @project = Project.find(params[:project_id])
    if !@project.owner?(session_obj)
      not_authorized and return
    end
    named_character = params[:character_type].constantize
    if existing = named_character.first(:conditions=>["project_id=?",@project.id])
      @project.characters.delete(existing)
      existing.destroy
    else
      @project.characters << named_character.new
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "characters" WHERE "characters"."type" IN ('Narrator') AND "characters"."id" = ?  [["id", 5]]
INSERT INTO "characters" ("created_at", "description", "name", "project_id", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @character = Character.find(params[:id])
    @project = @character.project
    if !@project.owner?(session_obj)
      not_authorized and return
    end
    respond_to do |format|
      if @character.update_attributes(params[:character])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", "22"]]
UPDATE "characters" SET "name" = 'Jim', "updated_at" = '2013-05-24 01:38:31.688562' WHERE "characters"."type" IN ('Narrator') AND "characters"."id" = 22