app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "157"]]
SELECT "events".* FROM "events" WHERE "events"."scene_id" = 20 AND "events"."order_index" = 1 LIMIT 1
SELECT "scenes".* FROM "scenes" WHERE "scenes"."id" = 20 LIMIT 1
UPDATE "events" SET "order_index" = 1, "updated_at" = '2013-05-20 07:31:37.617336' WHERE "events"."type" IN ('CharacterThinksEvent') AND "events"."id" = 45
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 8 LIMIT 1
---
  def moveup
    event = Event.find(params[:id])
    scene = event.scene
    prev_event = Event.where(:scene_id=>scene.id, :order_index=>event.order_index-1).first
    event.update_attribute(:order_index, event.order_index-1)
    prev_event.update_attribute(:order_index, prev_event.order_index+1)
    event.reorder_indexes
    #prev_event.set_all_characters_present
    respond_to do |format|
      format.html { redirect_to edit_project_scene_path(scene.project, scene, :event_index=>event.order_index) }

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "55"]]
SELECT "events".* FROM "events" WHERE "events"."scene_id" = 10 AND "events"."order_index" = 5 LIMIT 1
SELECT "scenes".* FROM "scenes" WHERE "scenes"."id" = 10 LIMIT 1
UPDATE "events" SET "order_index" = 5, "updated_at" = '2013-05-20 17:48:20.038232' WHERE "events"."type" IN ('CharacterSpeaksEvent') AND "events"."id" = 55
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 6 LIMIT 1
---
  def movedown
    event = Event.find(params[:id])
    scene = event.scene
    next_event = Event.where(:scene_id=>scene.id, :order_index=>event.order_index+1).first
    event.update_attribute(:order_index, event.order_index+1)
    next_event.update_attribute(:order_index, next_event.order_index-1)
    event.reorder_indexes
    #event.set_all_characters_present

    respond_to do |format|
      format.html { redirect_to edit_project_scene_path(scene.project, scene, :event_index=>event.order_index) }

SELECT "events".* FROM "events" WHERE (scene_id=20 ) AND (order_index = 8) LIMIT 1
DELETE FROM "events" WHERE "events"."type" IN ('BackgroundImageEvent') AND "events"."id" = ?  [["id", 155]]
SELECT "events".* FROM "events" WHERE "events"."scene_id" = 19 ORDER BY order_index ASC, id ASC
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 8 LIMIT 1
SELECT "scenes".* FROM "scenes" WHERE "scenes"."id" = 19 LIMIT 1
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "events" WHERE (scene_id=10 ) AND (order_index <= 12) AND (type='CharacterPoseEvent' and character_id=2) LIMIT 1) subquery_for_count
---
  def delete
    @event = Event.find(params[:id])
    @scene = @event.scene
    @project = @scene.project
    @event.destroy
    event_index = [@event.order_index, @scene.events.count].min