app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "8"]]

  def edit
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "8"]]

  def update
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "8"]]