app/controllers/projects_controller.rb

  def play
    @html_class = "player"
    @project = Project.find_by_id_and_basename(params[:id],params[:basename])
    @after_events = []
    @before_events = []
    if @project && (@project.public? || @project.owner?(session_obj))
      if params[:scene_id]
        @only_scene = true
        @scenes = [Scene.find(params[:scene_id])]
      else
        @only_scene = false
        @project.increment!(:views)
        @scenes = @project.scenes.ordered
      end
      if @project.temp?
        flash.now[:notice] = "Make sure to login to save your work."
      end
      if @scenes.empty?
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 8 AND "projects"."basename" = 'A-Night-to-Remember' LIMIT 1
SELECT "scenes".* FROM "scenes" WHERE "scenes"."project_id" = 8 ORDER BY order_index ASC, id ASC
UPDATE "projects" SET "views" = 1, "updated_at" = '2013-05-26 21:34:31.844941' WHERE "projects"."id" = 8
SELECT COUNT(*) FROM "scenes" WHERE "scenes"."project_id" = 8

  def create
    @project = Project.new(params[:project])
    first_project = session_obj.projects.empty?
    @project.owner_id = session_obj.id
    @project.owner_type = session_obj.type
    set_adult_cookie
    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("basename", "created_at", "owner_id", "owner_type", "public", "title", "updated_at", "views") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @project.update_attributes(params[:project])
---
UPDATE "projects" SET "title" = 'A Night to Remember2', "basename" = 'ANighttoRemember2', "updated_at" = '2013-05-24 02:48:33.767678' WHERE "projects"."id" = 8

  def destroy

    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 11]]