app/controllers/scenes_controller.rb

  def index
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "8"]]

  def reorder
    @scene = Scene.find(params[:id])
---
SELECT "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT 1  [["id", "20"]]

  def edit
    @body_class = "scene-editor"
    @scene = Scene.find(params[:id])
    @project = @scene.project
    @backlink = project_scenes_path(@project)
    @event_index =  params[:event_index] ? params[:event_index].to_i : @scene.middle_index
    @event_count = @scene.events.count
    @event_index = [@event_index, @event_count].min
---
SELECT "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT 1  [["id", "19"]]
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "events" WHERE (scene_id=10 ) AND (order_index <= 1) AND (type='CharacterPoseEvent' and character_id=2) LIMIT 1) subquery_for_count
SELECT "events".* FROM "events" WHERE (scene_id=10 ) AND (order_index <= 10) AND (type='CharacterPoseEvent' and character_id=2) ORDER BY order_index DESC LIMIT 1

  def create
    @project = Project.find(params[:project_id])
    @scene = @project.scenes.new(params[:scene])
    #load up initial background and music
    @scene.load_initial_events
    respond_to do |format|
      if @scene.save!
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "8"]]
INSERT INTO "events" ("character_id", "character_name", "character_type", "characters_present", "created_at", "filename", "order_index", "scene_id", "subfilename", "text", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "scenes" ("created_at", "custom_description", "order_index", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 20 May 2013 06:52:18 UTC +00:00], ["custom_description", nil], ["order_index", 2], ["project_id", 6], ["updated_at", Mon, 20 May 2013 06:52:18 UTC +00:00]]

  def update_event
    @body_class = "scene-editor"
    @scene = Scene.find(params[:id])
    @project = @scene.project
    @backlink = project_scenes_path(@project)
    @event = params[:event_id].present? ? Event.find(params[:event_id]) : @scene.events.new
    unless params[:event_id]
      flash[:notice] = "Good job! Add some more!"
    end
    respond_to do |format|
      if @event.update_attributes(params[:event])
        @event_index = @event.reload.order_index
        format.html { redirect_to action: "edit", event_index: @event_index, more_text: params[:more_text], more_text_type: params[:more_text_type]}
        format.json { head :no_content }
      else
        @event_index = @scene.events.count
---
SELECT "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT 1  [["id", "20"]]
SELECT "events".* FROM "events" WHERE (scene_id=22 ) AND (order_index <= 2) AND (type='LovePoseEvent') ORDER BY order_index DESC LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 8 LIMIT 1
UPDATE "events" SET "text" = 'In the above example, we have a few different scenarios involving HTML tags. First off, Rails should not escape the strong tag surrounding “friends”, because it is unambiguously not user input. Second, Rails should escape', "type" = 'CharacterSpeakEvent', "updated_at" = '2013-05-19 23:54:21.325608' WHERE "events"."type" IN ('CharacterSpeaksEvent') AND "events"."id" = 33
SELECT MAX("events"."order_index") AS max_id FROM "events" WHERE "events"."scene_id" = 11
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "events" WHERE (scene_id=10 ) AND (order_index <= 10) AND (type='CharacterPoseEvent' and character_id=2) LIMIT 1) subquery_for_count

  def destroy
    @scene = Scene.find(params[:id])
    @scene.destroy
---
SELECT "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT 1  [["id", "19"]]
DELETE FROM "scenes" WHERE "scenes"."id" = ?  [["id", 19]]