app/controllers/user_sessions_controller.rb

SELECT "users".* FROM "users" WHERE (LOWER("users".email) = 'nicole@highlinesale.com') LIMIT 1
---
  def create
    @user_session = UserSession.new(params[:user_session])

    #logger.info "USER LOGIN. User try to login with params with login #{params[:user_session][:email]} and remember me #{params[:user_session]["remember_me"]}"

    session[:return_to] = nil
    if @user_session.save
      if @user_session.record.may_login?
        Rails.logger.info "IN CREATE SESSION"
        #copy objects in the TempSession to the user
        email = params[:user_session][:email]
        temp_session = TempSession.new(request.session_options)
        user = User.find_by_email(email)